src/testsuite/sysbench/results/select_random_points.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 34823.85 qps: 34823.85 (r/w/o: 34823.85/0.00/0.00) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 36513.09 qps: 36513.09 (r/w/o: 36513.09/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 37250.10 qps: 37250.10 (r/w/o: 37250.10/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2176469
        write:                           0
        other:                           0
        total:                           2176469
    transactions:                        2176469 (36269.18 per sec.)
    queries:                             2176469 (36269.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      36269.1811
    time elapsed:                        60.0102s
    total number of events:              2176469

Latency (ms):
         min:                                    0.21
         avg:                                    3.53
         max:                                  127.98
         95th percentile:                        5.67
         sum:                              7675986.48

Threads fairness:
    events (avg/stddev):           17003.2344/1477.48
    execution time (avg/stddev):   59.9686/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 37384.63 qps: 37384.63 (r/w/o: 37384.63/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 37425.62 qps: 37425.62 (r/w/o: 37425.62/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 37406.52 qps: 37406.52 (r/w/o: 37406.52/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2244860
        write:                           0
        other:                           0
        total:                           2244860
    transactions:                        2244860 (37405.04 per sec.)
    queries:                             2244860 (37405.04 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      37405.0441
    time elapsed:                        60.0159s
    total number of events:              2244860

Latency (ms):
         min:                                    0.68
         avg:                                    3.42
         max:                                   71.08
         95th percentile:                        5.88
         sum:                              7675909.71

Threads fairness:
    events (avg/stddev):           17537.5547/3784.70
    execution time (avg/stddev):   59.9680/0.01